Tekla Open API Reference for Tekla Structures 2025
ViewShorteningAttributes Properties
The View.ViewShorteningAttributes type exposes the following members.
Properties
Name | Description
CutParts
 Defines whether cut parts are enabled (true) or disabled (false).
CutPartType
 Defines cut part type. Not used if CutParts is false.
CutSkewParts
 Defines whether cut skewed parts are enabled (true) or disabled (false).
MinimumLength
 The minimum cut part length.
Offset
 The space between the cut parts.
Top
See Also
Reference
View.ViewShorteningAttributes Class
Tekla.Structures.Drawing Namespace